src/DataProcessors/Обслуживание_ПРН_Windows.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Обслуживание_ПРН_Windows</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Comment>Текущий объект торгового оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogObject.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаОбластиПечати</Name>
					<Comment>в миллиметрах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоСимволовВСтроке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтОсновнойРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтДвойнойРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПринтера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПреПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШрифта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Обслуживание_ПРН_Windows/Forms/Форма/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		Предупреждение("Данная обработка используется для работы конфигурации. Вручную ее вызывать запрещено.");	
		Отказ = Истина;
		Возврат;  		
	КонецЕсли;   
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Сохранение параметров и закрытие формы
//
Процедура ОК(Кнопка)
	
	ЗаполнитьЗначенияСвойств(ПараметрыТО,ЭтотОбъект);
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура ИмяПринтераНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		wshNetwork = Новый ComОбъект("WScript.Network");
	Исключение
		Предупреждение("Ошибка создания системного объекта ""WScript.Network""
						|Введите имя принтера вручную...");
		Возврат;
	КонецПопытки;
	
	СписокПринетров = Новый СписокЗначений;
	
	Попытка
		oPrinters = wshNetwork.EnumPrinterConnections();
		i=0;
		while i<oPrinters.count()-1 do
			СписокПринетров.Добавить(oPrinters.item(i+1));
			i=i+2;
		enddo;
	Исключение
		Предупреждение("Ошибка получения списка принтеров.
						|Введите имя принтера вручную...");
		Возврат;
	КонецПопытки;
	
	ВыбЭлемент = ВыбратьИзМеню( СписокПринетров );
	Если ВыбЭлемент <> Неопределено Тогда
		ИмяПринтера = ВыбЭлемент.Значение;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ИмяШрифтаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ИмяШрифта = ВыбранноеЗначение;
	КонецЕсли; 

	
КонецПроцедуры

Процедура ОсновныеДействияФормыРекомендуемые(Кнопка)
	
	// После проверки и тестирвания нужно добавить в процедуру обновления, автозаполение уже существующих принтеров шрифта Courier
	ШиринаОбластиПечати		= 41;
	КолвоСимволовВСтроке	= 40;
	ИмяШрифта				= "Courier New";
	ШрифтОсновнойРазмер 	= 8;
	ШрифтДвойнойРазмер 		= 10;
	ПреПросмотр				= Ложь;

КонецПроцедуры


СписокКолвоСимволовВСтроке = Новый СписокЗначений;
СписокКолвоСимволовВСтроке.Добавить(32,"32");
СписокКолвоСимволовВСтроке.Добавить(35,"35");
СписокКолвоСимволовВСтроке.Добавить(36,"36");
СписокКолвоСимволовВСтроке.Добавить(40,"40");
СписокКолвоСимволовВСтроке.Добавить(42,"42");
СписокКолвоСимволовВСтроке.Добавить(44,"44");
СписокКолвоСимволовВСтроке.Добавить(48,"48");

ЭлементыФормы.КолвоСимволовВСтроке.СписокВыбора = СписокКолвоСимволовВСтроке;
